[fix] figure
